import React from "react";
import './HanumanChalisa.css';
import pic from './Hanuman.jpeg';
const HanumanChalisa = () => {
  return (
    <div className=" flex flex-col justify-center items-center  m-auto mainCont">
     <h1 className=" font-bold m-2 text-lg text-orange-600">
        श्री हनुमान चालीसा
      </h1>
      <img src={pic} alt="Sri Hanuman Ji"  className="w-full sm:w-1/2 lg:w-1/3"/>
      <div className=" mb-10 w-full">
        <h1 className=" font-bold m-2 text-lg text-red-500"> दोहा :</h1>
        <p  >
          श्रीगुरु चरन सरोज रज, निजमन मुकुरु सुधारि।
          <br /> बरनउं रघुबर बिमल जसु, जो दायक फल चारि।।
        </p>
        <p  >
          बुद्धिहीन तनु जानिके, सुमिरौं पवन-कुमार।
          <br /> बल बुधि बिद्या देहु मोहिं, हरहु कलेस बिकार।।
        </p>
      </div>
      <div className="w-full">
        <h1 className=" font-bold m-2 text-lg text-red-500">चौपाई :</h1>
        <p  >
          जय हनुमान ज्ञान गुन सागर।
          <br /> जय कपीस तिहुं लोक उजागर।।
        </p>
        <p >
          राम दूत अतुलित बल धामा।
          <br /> अंजनि-पुत्र पवनसुत नामा।।
        </p>
        <p  >
          महाबीर बिक्रम बजरंगी।
          <br /> कुमति निवार सुमति के संगी।।
        </p>
        <p  >
          कंचन बरन बिराज सुबेसा।
          <br /> कानन कुण्डल कुँचित केसा।।
        </p>
        <p  >
          हाथ बज्र औ ध्वजा बिराजे।
          <br /> कांधे मूंज जनेउ साजे।।
        </p>
        <p  >
          शंकर सुवन केसरी नंदन।
          <br /> तेज प्रताप महा जग वंदन।।
        </p>
        <p  >
          बिद्यावान गुनी अति चातुर।
          <br /> राम काज करिबे को आतुर।।
        </p>
        <p  >
          प्रभु चरित्र सुनिबे को रसिया।
          <br /> राम लखन सीता मन बसिया।।
        </p>
        <p  >
          सूक्ष्म रूप धरि सियहिं दिखावा।
          <br /> बिकट रूप धरि लंक जरावा।।
        </p>
        <p  >
          भीम रूप धरि असुर संहारे।
          <br /> रामचन्द्र के काज संवारे।।
        </p>
        <p  >
          लाय सजीवन लखन जियाये।
          <br /> श्री रघुबीर हरषि उर लाये।।
        </p>
        <p  >
          रघुपति कीन्ही बहुत बड़ाई।
          <br /> तुम मम प्रिय भरतहि सम भाई।।
        </p>
        <p  >
          सहस बदन तुम्हरो जस गावैं।
          <br /> अस कहि श्रीपति कण्ठ लगावैं।।
        </p>
        <p  >
          सनकादिक ब्रह्मादि मुनीसा।
          <br /> नारद सारद सहित अहीसा।।
        </p>
        <p  >
          जम कुबेर दिगपाल जहां ते।
          <br /> कबि कोबिद कहि सके कहां ते।।
        </p>
        <p  >
          तुम उपकार सुग्रीवहिं कीन्हा।
          <br /> राम मिलाय राज पद दीन्हा।।
        </p>
        <p  >
          तुम्हरो मंत्र बिभीषन माना।
          <br /> लंकेश्वर भए सब जग जाना।।
        </p>
        <p>
     
          जुग सहस्र जोजन पर भानु।
          <br /> लील्यो ताहि मधुर फल जानू।।
        </p>
        <p  >
 
          प्रभु मुद्रिका मेलि मुख माहीं।
          <br /> जलधि लांघि गये अचरज नाहीं।।
        </p>
        <p  >
  
          दुर्गम काज जगत के जेते।
          <br /> सुगम अनुग्रह तुम्हरे तेते।।
        </p>
        <p  >
          राम दुआरे तुम रखवारे।
          <br /> होत न आज्ञा बिनु पैसारे।।
        </p>
        <p  >
          सब सुख लहै तुम्हारी सरना।
          <br /> तुम रच्छक काहू को डर ना।।
        </p>
        <p  >

          आपन तेज सम्हारो आपै।
          <br /> तीनों लोक हांक तें कांपै।।
        </p>
        <p  >
          भूत पिसाच निकट नहिं आवै।
          <br /> महाबीर जब नाम सुनावै।।
        </p>
        
        <p  >
        नासै रोग हरे सब पीरा।
          <br /> जपत निरन्तर हनुमत बीरा।।
        </p>
        <p  >
          संकट तें हनुमान छुड़ावै।
          <br /> मन क्रम बचन ध्यान जो लावै।।
        </p>
        <p  >
          सब पर राम तपस्वी राजा।
          <br /> तिन के काज सकल तुम साजा।।
        </p>
        <p  >
          और मनोरथ जो कोई लावै।
          <br /> सोई अमित जीवन फल पावै।।
        </p>
        <p  >
          चारों जुग परताप तुम्हारा।
          <br /> है परसिद्ध जगत उजियारा।।
        </p>
        <p  >
          साधु संत के तुम रखवारे।।
          <br /> असुर निकन्दन राम दुलारे।।
        </p>
        <p  >
          अष्टसिद्धि नौ निधि के दाता।
          <br /> अस बर दीन जानकी माता।।
        </p>
        <p  >
          राम रसायन तुम्हरे पासा।
          <br /> सदा रहो रघुपति के दासा।।
        </p>
        <p  >
          तुह्मरे भजन राम को पावै।
          <br /> जनम जनम के दुख बिसरावै।।
        </p>
        <p  >
          अंत काल रघुबर पुर जाई।
          <br /> जहां जन्म हरिभक्त कहाई।।
        </p>
        <p  >
          और देवता चित्त न धरई।
          <br /> हनुमत सेइ सर्ब सुख करई।।
        </p>
        <p  >
          सङ्कट कटै मिटै सब पीरा।
          <br /> जो सुमिरै हनुमत बलबीरा।।
        </p>
        <p  >
          जय जय जय हनुमान गोसाईं।
          <br /> कृपा करहु गुरुदेव की नाईं।।
        </p>
        <p  >
          जो सत बार पाठ कर कोई।
          <br /> छूटहि बन्दि महा सुख होई।।
        </p>
        <p  >
          जो यह पढ़ै हनुमान चालीसा।
          <br /> होय सिद्धि साखी गौरीसा।।
        </p>
        <p  >

          तुलसीदास सदा हरि चेरा।
          <br /> कीजै नाथ हृदय महं डेरा।।
        </p>
      </div>
      <div>
        <h1 className=" font-bold m-2 text-lg text-red-500">दोहा :</h1>
        <p >
          पवनतनय संकट हरन, मंगल मूरति रूप।
          <br /> राम लखन सीता सहित, हृदय बसहु सुर भूप।।
        </p>
      </div>
    </div>
  );
};

export default HanumanChalisa;
